## 🏗️ Terraform Plan Summary

| Step | Status |
|------|:------:|
| 🖌 Format & Style | ✅ `success` |
| ⚙️ Initialization | ✅ `success` |
| 🤖 Validation | ✅ `success` |
| 📖 Plan | ✅ `success` |

<details><summary>Validation Output</summary>

```
Success! The configuration is valid.
```

</details>

<details><summary>Plan Output</summary>

```terraform
data.terraform_remote_state.main: Reading...
random_id.bucket_suffix: Refreshing state... [id=MCNDqQ]
data.terraform_remote_state.main: Read complete after 0s
google_vertex_ai_reasoning_engine.session_and_memory: Refreshing state... [id=projects/doug-hayden-eng-sandbox/locations/us-central1/reasoningEngines/1909328329912090624]
google_service_account.app: Refreshing state... [id=projects/doug-hayden-eng-sandbox/serviceAccounts/adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_storage_bucket.artifact_service: Refreshing state... [id=adk-docker-uv-default-artifact-service-302343a9]
google_project_iam_member.app["roles/telemetry.tracesWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/telemetry.tracesWriter/serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/aiplatform.user"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/aiplatform.user/serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/logging.logWriter"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/logging.logWriter/serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/serviceusage.serviceUsageConsumer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/serviceusage.serviceUsageConsumer/serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.bucketViewer"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.bucketViewer/serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/cloudtrace.agent"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/cloudtrace.agent/serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_project_iam_member.app["roles/storage.objectUser"]: Refreshing state... [id=doug-hayden-eng-sandbox/roles/storage.objectUser/serviceAccount:adk-docker-uv-default@doug-hayden-eng-sandbox.iam.gserviceaccount.com]
google_cloud_run_v2_service.app["us-central1"]: Refreshing state... [id=projects/doug-hayden-eng-sandbox/locations/us-central1/services/adk-docker-uv-default]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloud_run_v2_service.app["us-central1"] is tainted, so must be replaced
-/+ resource "google_cloud_run_v2_service" "app" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - last_transition_time = "2025-11-28T01:11:31.720197Z"
              - message              = <<-EOT
                    The user-provided container failed the configured startup probe checks. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=doug-hayden-eng-sandbox&resource=cloud_run_revision/service_name/adk-docker-uv-default/revision_name/adk-docker-uv-default-00001-lqn&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22adk-docker-uv-default%22%0Aresource.labels.revision_name%3D%22adk-docker-uv-default-00001-lqn%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "RoutesReady"
                # (3 unchanged attributes hidden)
            },
          - {
              - last_transition_time = "2025-11-28T01:11:31.602516Z"
              - message              = <<-EOT
                    The user-provided container failed the configured startup probe checks. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=doug-hayden-eng-sandbox&resource=cloud_run_revision/service_name/adk-docker-uv-default/revision_name/adk-docker-uv-default-00001-lqn&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22adk-docker-uv-default%22%0Aresource.labels.revision_name%3D%22adk-docker-uv-default-00001-lqn%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "ConfigurationsReady"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ create_time             = "2025-11-28T01:10:34.603266Z" -> (known after apply)
      ~ creator                 = "repo:doughayden/adk-docker-uv:ref:refs/heads/main (projects/136454482223/locations/global/workloadIdentityPools/adk-docker-uv-github)" -> (known after apply)
      - custom_audiences        = [] -> null
      - default_uri_disabled    = false -> null
      + delete_time             = (known after apply)
      ~ effective_annotations   = {} -> (known after apply)
      ~ etag                    = ""CIrto8kGENC31J8C/cHJvamVjdHMvZG91Zy1oYXlkZW4tZW5nLXNhbmRib3gvbG9jYXRpb25zL3VzLWNlbnRyYWwxL3NlcnZpY2VzL2Fkay1kb2NrZXItdXYtZGVmYXVsdA"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "1" -> (known after apply)
      ~ id                      = "projects/doug-hayden-eng-sandbox/locations/us-central1/services/adk-docker-uv-default" -> (known after apply)
      - invoker_iam_disabled    = false -> null
      ~ last_modifier           = "repo:doughayden/adk-docker-uv:ref:refs/heads/main (projects/136454482223/locations/global/workloadIdentityPools/adk-docker-uv-github)" -> (known after apply)
      ~ latest_created_revision = "projects/doug-hayden-eng-sandbox/locations/us-central1/services/adk-docker-uv-default/revisions/adk-docker-uv-default-00001-lqn" -> (known after apply)
      + latest_ready_revision   = (known after apply)
        name                    = "adk-docker-uv-default"
      ~ observed_generation     = "1" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - last_transition_time = "2025-11-28T01:11:31.720197Z"
              - message              = <<-EOT
                    The user-provided container failed the configured startup probe checks. Logs for this revision might contain more information.
                    
                    Logs URL: https://console.cloud.google.com/logs/viewer?project=doug-hayden-eng-sandbox&resource=cloud_run_revision/service_name/adk-docker-uv-default/revision_name/adk-docker-uv-default-00001-lqn&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22adk-docker-uv-default%22%0Aresource.labels.revision_name%3D%22adk-docker-uv-default-00001-lqn%22 
                    For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                EOT
              - revision_reason      = "HEALTH_CHECK_CONTAINER_ERROR"
              - state                = "CONDITION_FAILED"
              - type                 = "Ready"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ traffic_statuses        = [] -> (known after apply)
      ~ uid                     = "00b9ad31-139f-4344-9cf4-fc67e79cf654" -> (known after apply)
      ~ update_time             = "2025-11-28T01:10:34.603266Z" -> (known after apply)
      + uri                     = (known after apply)
      ~ urls                    = [
          - "https://adk-docker-uv-default-136454482223.us-central1.run.app",
        ] -> (known after apply)
        # (11 unchanged attributes hidden)

      ~ scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (2 unchanged attributes hidden)
        }

      ~ template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - health_check_disabled            = false -> null
          - labels                           = {} -> null
          - session_affinity                 = false -> null
            # (6 unchanged attributes hidden)

          ~ containers {
              - args           = [] -> null
              ~ build_info     = [] -> (known after apply)
              - command        = [] -> null
              - depends_on     = [] -> null
              ~ image          = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/adk-docker-uv/adk-docker-uv@sha256:7e90cb281f1a3137d741333563e02417fe16aa3183834e8ff66e2004750f9ec1" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/adk-docker-uv/adk-docker-uv@sha256:c3bfddea3931943dee8a3180c0a0da2acfdcb68ca88cedbc4be6721b3147473d"
                name           = null
                # (2 unchanged attributes hidden)

              + env {
                  + name  = "OTEL_INSTRUMENTATION_GENAI_CAPTURE_MESSAGE_CONTENT"
                  + value = "TRUE"
                }

              ~ resources {
                  - startup_cpu_boost = false -> null
                    # (2 unchanged attributes hidden)
                }

                # (15 unchanged blocks hidden)
            }

          ~ scaling (known after apply)
          - scaling {
              - max_instance_count = 100 -> null
              - min_instance_count = 0 -> null
            }
        }

      ~ traffic (known after apply)
      - traffic {
          - percent  = 100 -> null
          - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ cloud_run_services               = {
      ~ us-central1 = {
          ~ latest_ready_revision = "adk-docker-uv-00010-4xd" -> (known after apply)
          ~ update_time           = "2025-11-26T23:34:42.658047Z" -> (known after apply)
          ~ uri                   = "https://adk-docker-uv-645mxjt3sq-uc.a.run.app" -> (known after apply)
        }
    }
  ~ configured_environment_variables = {
      + OTEL_INSTRUMENTATION_GENAI_CAPTURE_MESSAGE_CONTENT = "TRUE"
        # (13 unchanged attributes hidden)
    }
  ~ deployed_image                   = "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/adk-docker-uv/adk-docker-uv@sha256:7e90cb281f1a3137d741333563e02417fe16aa3183834e8ff66e2004750f9ec1" -> "us-central1-docker.pkg.dev/doug-hayden-eng-sandbox/adk-docker-uv/adk-docker-uv@sha256:c3bfddea3931943dee8a3180c0a0da2acfdcb68ca88cedbc4be6721b3147473d"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>

---